**Terraform Format and Style🖌** `success`
**Terraform Initialization ⚙️** `success`
**Terraform Plan 📖** `success`
**Terraform Validation 🤖** `success`

<details><summary>Show Plan</summary>

```hcl
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Reading...
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Reading...
data.tls_certificate.github: Reading...
dnsimple_zone_record.google_workspace_verification: Refreshing state... [id=37701471]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701470]
module.dnsimple_short_io.dnsimple_zone_record.a_record_1: Refreshing state... [id=37701464]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26880813]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mail: Refreshing state... [id=26880812]
module.aws_fastmail_georgewitteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_witteman_me.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_georgewitteman_com.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.aws_fastmail_wtmn_net.data.dns_a_record_set.mail: Read complete after 0s [id=mail.fastmail.com]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=29377247]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161944]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_submission: Refreshing state... [id=26880815]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701467]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=26161936]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161949]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161947]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701461]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161934]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701465]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[0]: Refreshing state... [id=37701474]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[1]: Refreshing state... [id=37701460]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[2]: Refreshing state... [id=37701473]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.a_records[3]: Refreshing state... [id=37701475]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26161937]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701459]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701458]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_jmap: Refreshing state... [id=26880820]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326125]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.spf: Refreshing state... [id=37701469]
module.dnsimple_github_pages.dnsimple_zone_record.cname-record-www: Refreshing state... [id=26161971]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.spf: Refreshing state... [id=37701456]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701476]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mail: Refreshing state... [id=26161935]
dnsimple_zone_record.files_wtmn_net_alias: Refreshing state... [id=27004600]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161955]
module.dnsimple_short_io.dnsimple_zone_record.a_record_2: Refreshing state... [id=37701472]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.bimi: Refreshing state... [id=32326126]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161953]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26880818]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161954]
data.tls_certificate.github: Read complete after 0s [id=ce2f7f71e49a92b06847b8c74d5b44925a94ff6e]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_imaps: Refreshing state... [id=29377249]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161945]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=26161942]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.verify_cname: Refreshing state... [id=28036170]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161939]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mail: Refreshing state... [id=26161951]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[2]: Refreshing state... [id=29377244]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[0]: Refreshing state... [id=29377241]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dkim[1]: Refreshing state... [id=29377245]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_submission: Refreshing state... [id=29377242]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161943]
module.dnsimple_github_pages.dnsimple_zone_record.alias-record-root: Refreshing state... [id=37701462]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.spf: Refreshing state... [id=37701457]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.bimi: Refreshing state... [id=32326123]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26161958]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=26161972]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.bimi: Refreshing state... [id=32326124]
module.dnsimple_squarespace_marcywitteman_com.dnsimple_zone_record.www_cname: Refreshing state... [id=28036169]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.mx_20[0]: Refreshing state... [id=37701468]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26161931]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26161932]
module.dnsimple_fastmail_georgewitteman_com.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26161933]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26161946]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26161962]
module.dnsimple_fastmail_witteman_me.dnsimple_zone_record.mx_10[0]: Refreshing state... [id=37701466]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.dmarc[0]: Refreshing state... [id=29377239]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_jmap: Refreshing state... [id=29377237]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_imaps: Refreshing state... [id=26880816]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=26880821]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_pop3s: Refreshing state... [id=29377246]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.srv_caldavs: Refreshing state... [id=26880814]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.srv_carddavs: Refreshing state... [id=29377238]
module.dnsimple_fastmail_georgewitteman_me.dnsimple_zone_record.mail: Refreshing state... [id=29377236]
dnsimple_zone_record.github_redirect: Refreshing state... [id=26395267]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[0]: Refreshing state... [id=26880823]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[1]: Refreshing state... [id=26880824]
module.dnsimple_fastmail_wtmn_net.dnsimple_zone_record.dkim[2]: Refreshing state... [id=26880825]
data.github_user.georgewitteman: Reading...
data.github_repository.terraform: Reading...
data.github_repository.terraform: Read complete after 0s [id=terraform]
data.github_user.georgewitteman: Read complete after 0s [id=5918935]
module.acm_witteman_test_com.aws_route53_record.this["witteman-test.com"]: Refreshing state... [id=Z00288031C5HWCGKS61C1__e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com._CNAME]
aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::866631827662:oidc-provider/token.actions.githubusercontent.com]
module.acm_witteman_test_com.aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:866631827662:certificate/6122c741-9a3c-4019-a519-fdc8fac8d2e3]
module.acm_witteman_test_com.aws_acm_certificate_validation.this: Refreshing state... [id=2022-10-11 15:11:26.752 +0000 UTC]
aws_s3_bucket.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
module.vault.data.aws_region.current: Reading...
module.vault.data.aws_iam_policy_document.instance_role: Reading...
module.vault.data.aws_ami.ubuntu: Reading...
aws_route53_zone.witteman_me: Refreshing state... [id=Z05063061CYA524JAU8BC]
module.vault.data.aws_region.current: Read complete after 0s [id=us-east-1]
aws_key_pair.georgewitteman: Refreshing state... [id=georgewitteman-personal]
module.vault.data.aws_iam_policy_document.instance_role: Read complete after 0s [id=1903849331]
aws_s3_bucket.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_eip.nat[0]: Refreshing state... [id=eipalloc-0f95edc7d600a0f11]
module.vault.data.aws_ami.ubuntu: Read complete after 0s [id=ami-096e0c14792ec93ac]
aws_vpc.this: Refreshing state... [id=vpc-0531d36726bdd6529]
aws_eip.nat[1]: Refreshing state... [id=eipalloc-0eab7a9978907b615]
aws_route53_zone.witteman_test_com: Refreshing state... [id=Z00288031C5HWCGKS61C1]
aws_kms_key.primary_kms_key: Refreshing state... [id=d5eef806-22ba-4f53-a96f-3d3e6e545e07]
aws_kms_key.dynamo_db_kms: Refreshing state... [id=1a1ca031-daf5-4f17-aa7d-2d2d2ca5a865]
aws_route53_zone.georgewitteman_com: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN]
aws_route53_zone.marcywitteman_com: Refreshing state... [id=Z0939016Z0WL8RV5A0D1]
aws_route53_zone.georgewitteman_me: Refreshing state... [id=Z0431101102WXYNRXVF0T]
aws_route53_zone.wtmn_net: Refreshing state... [id=Z093069418CSBZIY3FKFL]
data.aws_iam_policy_document.github_oidc: Reading...
data.aws_iam_policy_document.github_oidc: Read complete after 0s [id=1151702415]
aws_dynamodb_table.terraform_locks: Refreshing state... [id=terraform-locks]
aws_route53_record.witteman_me_txt: Refreshing state... [id=Z05063061CYA524JAU8BC__TXT]
aws_iam_role.github_oidc: Refreshing state... [id=GitHubActionsOIDC]
module.aws_fastmail_witteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z05063061CYA524JAU8BC__submission._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mail: Refreshing state... [id=Z05063061CYA524JAU8BC_mail_A]
module.aws_fastmail_witteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z05063061CYA524JAU8BC__dmarc_TXT]
module.aws_fastmail_witteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z05063061CYA524JAU8BC__jmap._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.mx: Refreshing state... [id=Z05063061CYA524JAU8BC__MX]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z05063061CYA524JAU8BC__caldavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z05063061CYA524JAU8BC__carddav._tcp_SRV]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_witteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z05063061CYA524JAU8BC__pop3._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z05063061CYA524JAU8BC__caldav._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z05063061CYA524JAU8BC__imaps._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z05063061CYA524JAU8BC__carddavs._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z05063061CYA524JAU8BC__imap._tcp_SRV]
aws_route53domains_registered_domain.witteman_test_com: Refreshing state... [id=witteman-test.com]
aws_route53_record.georgewitteman_com_txt: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__TXT]
aws_route53_record.georgewitteman_me_txt: Refreshing state... [id=Z0431101102WXYNRXVF0T__TXT]
aws_subnet.private[1]: Refreshing state... [id=subnet-083e37d65579ec479]
aws_internet_gateway.this: Refreshing state... [id=igw-03e5d4bd084f0bab7]
module.aws_fastmail_witteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z05063061CYA524JAU8BC]
aws_subnet.public[0]: Refreshing state... [id=subnet-00d39134e9b5fa53b]
aws_route_table.public: Refreshing state... [id=rtb-0d091192150dea7f5]
aws_subnet.public[1]: Refreshing state... [id=subnet-00ae48e4b817339e0]
aws_subnet.private[0]: Refreshing state... [id=subnet-051e9de45c87a959d]
aws_route53_record.wtmn_net_txt: Refreshing state... [id=Z093069418CSBZIY3FKFL__TXT]
aws_s3_bucket_public_access_block.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_versioning.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_public_access_block.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_logging.terraform_state: Refreshing state... [id=georgewitteman-terraform-state]
aws_s3_bucket_server_side_encryption_configuration.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
aws_s3_bucket_acl.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs,log-delivery-write]
aws_s3_bucket_versioning.log_bucket: Refreshing state... [id=georgewitteman-terraform-logs]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mx: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__MX]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3s: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3s._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_jmap: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dmarc[0]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__dmarc_TXT]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_imaps: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_submission: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__submission._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_pop3: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_carddavs: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.srv_caldav: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_com.aws_route53_record.mail: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_mail_A]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Reading...
module.aws_squarespace_marcywitteman_com.aws_route53_record.verify_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_ygcg8lysbebsftxsez6l_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.www_cname: Refreshing state... [id=Z0939016Z0WL8RV5A0D1_www_CNAME]
module.aws_squarespace_marcywitteman_com.aws_route53_record.a: Refreshing state... [id=Z0939016Z0WL8RV5A0D1__A]
module.aws_fastmail_georgewitteman_com.data.aws_route53_zone.selected: Read complete after 0s [id=Z04997513SHTSY0FZ1ZPN]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mail: Refreshing state... [id=Z0431101102WXYNRXVF0T_mail_A]
module.vault.data.aws_vpc.selected: Reading...
module.aws_fastmail_georgewitteman_me.aws_route53_record.dmarc[0]: Refreshing state... [id=Z0431101102WXYNRXVF0T__dmarc_TXT]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_jmap: Refreshing state... [id=Z0431101102WXYNRXVF0T__jmap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_submission: Refreshing state... [id=Z0431101102WXYNRXVF0T__submission._tcp_SRV]
module.vault.data.aws_vpc.selected: Read complete after 0s [id=vpc-0531d36726bdd6529]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddavs: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddavs._tcp_SRV]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Reading...
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_caldav: Refreshing state... [id=Z0431101102WXYNRXVF0T__caldav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imaps: Refreshing state... [id=Z0431101102WXYNRXVF0T__imaps._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_carddav: Refreshing state... [id=Z0431101102WXYNRXVF0T__carddav._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.mx: Refreshing state... [id=Z0431101102WXYNRXVF0T__MX]
module.aws_fastmail_georgewitteman_me.data.aws_route53_zone.selected: Read complete after 1s [id=Z0431101102WXYNRXVF0T]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_imap: Refreshing state... [id=Z0431101102WXYNRXVF0T__imap._tcp_SRV]
module.aws_fastmail_georgewitteman_me.aws_route53_record.srv_pop3s: Refreshing state... [id=Z0431101102WXYNRXVF0T__pop3s._tcp_SRV]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm2._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm3._domainkey_CNAME]
module.aws_fastmail_witteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z05063061CYA524JAU8BC_fm1._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imap: Refreshing state... [id=Z093069418CSBZIY3FKFL__imap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_imaps: Refreshing state... [id=Z093069418CSBZIY3FKFL__imaps._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3s: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3s._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.dmarc[0]: Refreshing state... [id=Z093069418CSBZIY3FKFL__dmarc_TXT]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_jmap: Refreshing state... [id=Z093069418CSBZIY3FKFL__jmap._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_pop3: Refreshing state... [id=Z093069418CSBZIY3FKFL__pop3._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_caldav: Refreshing state... [id=Z093069418CSBZIY3FKFL__caldav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddav: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddav._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_carddavs: Refreshing state... [id=Z093069418CSBZIY3FKFL__carddavs._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.srv_submission: Refreshing state... [id=Z093069418CSBZIY3FKFL__submission._tcp_SRV]
module.aws_fastmail_wtmn_net.aws_route53_record.mx: Refreshing state... [id=Z093069418CSBZIY3FKFL__MX]
module.aws_fastmail_wtmn_net.aws_route53_record.mail: Refreshing state... [id=Z093069418CSBZIY3FKFL_mail_A]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Reading...
aws_route.public_internet_gateway: Refreshing state... [id=r-rtb-0d091192150dea7f51080289494]
aws_nat_gateway.this[0]: Refreshing state... [id=nat-02ad6f5e0e62d6084]
aws_nat_gateway.this[1]: Refreshing state... [id=nat-0b3ba6295ff432385]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-00f61e31cf053bde0]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-050a400e2080b4c11]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm3._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_com.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z04997513SHTSY0FZ1ZPN_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm1._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm2._domainkey_CNAME]
module.aws_fastmail_georgewitteman_me.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z0431101102WXYNRXVF0T_fm3._domainkey_CNAME]
aws_route_table.private[0]: Refreshing state... [id=rtb-09d9f2dcbbb27c73c]
aws_route_table.private[1]: Refreshing state... [id=rtb-0421fc362d0be267c]
aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-09d9f2dcbbb27c73c1080289494]
aws_route.private_nat_gateway[1]: Refreshing state... [id=r-rtb-0421fc362d0be267c1080289494]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-086178e831a055e81]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-069aefed8b305b68b]
module.aws_fastmail_wtmn_net.data.aws_route53_zone.selected: Read complete after 3s [id=Z093069418CSBZIY3FKFL]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm1"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm1._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm2"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm2._domainkey_CNAME]
module.aws_fastmail_wtmn_net.aws_route53_record.dkim["fm3"]: Refreshing state... [id=Z093069418CSBZIY3FKFL_fm3._domainkey_CNAME]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # aws_acm_certificate.vault will be created
  + resource "aws_acm_certificate" "vault" {
      + arn                       = (known after apply)
      + domain_name               = "vault.witteman-test.com"
      + domain_validation_options = [
          + {
              + domain_name           = "vault.witteman-test.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + not_after                 = (known after apply)
      + not_before                = (known after apply)
      + pending_renewal           = (known after apply)
      + renewal_eligibility       = (known after apply)
      + renewal_summary           = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "vault.witteman-test.com",
        ]
      + tags_all                  = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + type                      = (known after apply)
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # aws_acm_certificate_validation.vault will be created
  + resource "aws_acm_certificate_validation" "vault" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.acm_vault["vault.witteman-test.com"] will be created
  + resource "aws_route53_record" "acm_vault" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = "Z00288031C5HWCGKS61C1"
    }

  # aws_route53_record.vault will be created
  + resource "aws_route53_record" "vault" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "vault"
      + records         = (known after apply)
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "Z00288031C5HWCGKS61C1"
    }

  # module.acm_witteman_test_com.aws_acm_certificate.this will be destroyed
  # (because aws_acm_certificate.this is not in configuration)
  - resource "aws_acm_certificate" "this" {
      - arn                       = "arn:aws:acm:us-east-1:866631827662:certificate/6122c741-9a3c-4019-a519-fdc8fac8d2e3" -> null
      - domain_name               = "witteman-test.com" -> null
      - domain_validation_options = [
          - {
              - domain_name           = "witteman-test.com"
              - resource_record_name  = "_e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com."
              - resource_record_type  = "CNAME"
              - resource_record_value = "_639adaab08644626152dca8624896545.bcnrdwzwjt.acm-validations.aws."
            },
        ] -> null
      - id                        = "arn:aws:acm:us-east-1:866631827662:certificate/6122c741-9a3c-4019-a519-fdc8fac8d2e3" -> null
      - not_after                 = "2023-11-09T23:59:59Z" -> null
      - not_before                = "2022-10-11T00:00:00Z" -> null
      - pending_renewal           = false -> null
      - renewal_eligibility       = "INELIGIBLE" -> null
      - renewal_summary           = [] -> null
      - status                    = "ISSUED" -> null
      - subject_alternative_names = [
          - "witteman-test.com",
        ] -> null
      - tags                      = {} -> null
      - tags_all                  = {
          - "Repository" = "georgewitteman/terraform"
          - "Terraform"  = "true"
        } -> null
      - type                      = "AMAZON_ISSUED" -> null
      - validation_emails         = [] -> null
      - validation_method         = "DNS" -> null

      - options {
          - certificate_transparency_logging_preference = "ENABLED" -> null
        }
    }

  # module.acm_witteman_test_com.aws_acm_certificate_validation.this will be destroyed
  # (because aws_acm_certificate_validation.this is not in configuration)
  - resource "aws_acm_certificate_validation" "this" {
      - certificate_arn         = "arn:aws:acm:us-east-1:866631827662:certificate/6122c741-9a3c-4019-a519-fdc8fac8d2e3" -> null
      - id                      = "2022-10-11 15:11:26.752 +0000 UTC" -> null
      - validation_record_fqdns = [
          - "_e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com",
        ] -> null
    }

  # module.acm_witteman_test_com.aws_route53_record.this["witteman-test.com"] will be destroyed
  # (because aws_route53_record.this is not in configuration)
  - resource "aws_route53_record" "this" {
      - allow_overwrite = true -> null
      - fqdn            = "_e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com" -> null
      - id              = "Z00288031C5HWCGKS61C1__e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com._CNAME" -> null
      - name            = "_e8ebe3fc20a570a68c18c8942cd1c359.witteman-test.com" -> null
      - records         = [
          - "_639adaab08644626152dca8624896545.bcnrdwzwjt.acm-validations.aws.",
        ] -> null
      - ttl             = 60 -> null
      - type            = "CNAME" -> null
      - zone_id         = "Z00288031C5HWCGKS61C1" -> null
    }

  # module.vault.aws_autoscaling_group.vault will be created
  + resource "aws_autoscaling_group" "vault" {
      + arn                       = (known after apply)
      + availability_zones        = (known after apply)
      + default_cooldown          = (known after apply)
      + desired_capacity          = 2
      + force_delete              = false
      + force_delete_warm_pool    = false
      + health_check_grace_period = 300
      + health_check_type         = (known after apply)
      + id                        = (known after apply)
      + max_size                  = 2
      + metrics_granularity       = "1Minute"
      + min_size                  = 2
      + name                      = "main-vault"
      + name_prefix               = (known after apply)
      + protect_from_scale_in     = false
      + service_linked_role_arn   = (known after apply)
      + target_group_arns         = (known after apply)
      + vpc_zone_identifier       = [
          + "subnet-051e9de45c87a959d",
          + "subnet-083e37d65579ec479",
        ]
      + wait_for_capacity_timeout = "10m"

      + launch_template {
          + id      = (known after apply)
          + name    = (known after apply)
          + version = "$Latest"
        }

      + tag {
          + key                 = "Name"
          + propagate_at_launch = true
          + value               = "main-vault-server"
        }
      + tag {
          + key                 = "main-vault"
          + propagate_at_launch = true
          + value               = "server"
        }
    }

  # module.vault.aws_iam_instance_profile.vault will be created
  + resource "aws_iam_instance_profile" "vault" {
      + arn         = (known after apply)
      + create_date = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + name_prefix = "main-vault"
      + path        = "/"
      + role        = (known after apply)
      + tags_all    = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + unique_id   = (known after apply)
    }

  # module.vault.aws_iam_role.instance_role will be created
  + resource "aws_iam_role" "instance_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "main-vault"
      + path                  = "/"
      + tags_all              = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.vault.aws_kms_key.this will be created
  + resource "aws_kms_key" "this" {
      + arn                                = (known after apply)
      + bypass_policy_lockout_safety_check = false
      + customer_master_key_spec           = "SYMMETRIC_DEFAULT"
      + description                        = "AWS KMS Customer-managed key used for Vault auto-unseal and encryption"
      + enable_key_rotation                = true
      + id                                 = (known after apply)
      + is_enabled                         = true
      + key_id                             = (known after apply)
      + key_usage                          = "ENCRYPT_DECRYPT"
      + multi_region                       = (known after apply)
      + policy                             = (known after apply)
      + tags_all                           = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
    }

  # module.vault.aws_launch_template.vault will be created
  + resource "aws_launch_template" "vault" {
      + arn                    = (known after apply)
      + default_version        = (known after apply)
      + id                     = (known after apply)
      + image_id               = "ami-096e0c14792ec93ac"
      + instance_type          = "t2.micro"
      + key_name               = "georgewitteman-personal"
      + latest_version         = (known after apply)
      + name                   = "main-vault"
      + name_prefix            = (known after apply)
      + tags_all               = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + user_data              = (known after apply)
      + vpc_security_group_ids = (known after apply)

      + block_device_mappings {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + iops                  = 3000
              + throughput            = 150
              + volume_size           = 100
              + volume_type           = "gp3"
            }
        }

      + iam_instance_profile {
          + arn = (known after apply)
        }

      + metadata_options {
          + http_endpoint               = "enabled"
          + http_protocol_ipv6          = "disabled"
          + http_put_response_hop_limit = (known after apply)
          + http_tokens                 = "required"
          + instance_metadata_tags      = "disabled"
        }
    }

  # module.vault.aws_lb.vault_lb will be created
  + resource "aws_lb" "vault_lb" {
      + arn                        = (known after apply)
      + arn_suffix                 = (known after apply)
      + desync_mitigation_mode     = "defensive"
      + dns_name                   = (known after apply)
      + drop_invalid_header_fields = true
      + enable_deletion_protection = false
      + enable_http2               = true
      + enable_waf_fail_open       = false
      + id                         = (known after apply)
      + idle_timeout               = 60
      + internal                   = true
      + ip_address_type            = (known after apply)
      + load_balancer_type         = "application"
      + name                       = "main-vault-lb"
      + preserve_host_header       = false
      + security_groups            = (known after apply)
      + subnets                    = [
          + "subnet-051e9de45c87a959d",
          + "subnet-083e37d65579ec479",
        ]
      + tags_all                   = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                     = (known after apply)
      + zone_id                    = (known after apply)

      + subnet_mapping {
          + allocation_id        = (known after apply)
          + ipv6_address         = (known after apply)
          + outpost_id           = (known after apply)
          + private_ipv4_address = (known after apply)
          + subnet_id            = (known after apply)
        }
    }

  # module.vault.aws_lb_listener.vault will be created
  + resource "aws_lb_listener" "vault" {
      + arn               = (known after apply)
      + certificate_arn   = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = (known after apply)
      + port              = 8200
      + protocol          = "HTTPS"
      + ssl_policy        = "ELBSecurityPolicy-TLS-1-2-2017-01"
      + tags_all          = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.vault.aws_lb_target_group.vault will be created
  + resource "aws_lb_target_group" "vault" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = false
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancing_algorithm_type      = (known after apply)
      + name                               = "main-vault-tg"
      + port                               = 8200
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTPS"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags_all                           = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0531d36726bdd6529"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 3
          + interval            = 30
          + matcher             = (known after apply)
          + path                = "/v1/sys/health?activecode=200&standbycode=200&sealedcode=200&uninitcode=200"
          + port                = "traffic-port"
          + protocol            = "HTTPS"
          + timeout             = (known after apply)
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = (known after apply)
          + cookie_name     = (known after apply)
          + enabled         = (known after apply)
          + type            = (known after apply)
        }
    }

  # module.vault.aws_secretsmanager_secret.tls will be created
  + resource "aws_secretsmanager_secret" "tls" {
      + arn                            = (known after apply)
      + description                    = "contains TLS certs and private keys"
      + force_overwrite_replica_secret = false
      + id                             = (known after apply)
      + kms_key_id                     = (known after apply)
      + name                           = "main-tls-secret"
      + name_prefix                    = (known after apply)
      + policy                         = (known after apply)
      + recovery_window_in_days        = 30
      + rotation_enabled               = (known after apply)
      + rotation_lambda_arn            = (known after apply)
      + tags_all                       = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }

      + replica {
          + kms_key_id         = (known after apply)
          + last_accessed_date = (known after apply)
          + region             = (known after apply)
          + status             = (known after apply)
          + status_message     = (known after apply)
        }

      + rotation_rules {
          + automatically_after_days = (known after apply)
        }
    }

  # module.vault.aws_secretsmanager_secret_version.tls will be created
  + resource "aws_secretsmanager_secret_version" "tls" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = (known after apply)
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # module.vault.aws_security_group.vault will be created
  + resource "aws_security_group" "vault" {
      + arn                    = (known after apply)
      + description            = "Security group for Vault"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-vault"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0531d36726bdd6529"
    }

  # module.vault.aws_security_group.vault_lb will be created
  + resource "aws_security_group" "vault_lb" {
      + arn                    = (known after apply)
      + description            = "Security group for the application load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "main-vault-lb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = {
          + "Repository" = "georgewitteman/terraform"
          + "Terraform"  = "true"
        }
      + vpc_id                 = "vpc-0531d36726bdd6529"
    }

  # module.vault.aws_security_group_rule.vault_internal_api will be created
  + resource "aws_security_group_rule" "vault_internal_api" {
      + description              = "Allow Vault nodes to reach other on port 8200 for API"
      + from_port                = 8200
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 8200
      + type                     = "ingress"
    }

  # module.vault.aws_security_group_rule.vault_internal_raft will be created
  + resource "aws_security_group_rule" "vault_internal_raft" {
      + description              = "Allow Vault nodes to communicate on port 8201 for replication traffic, request forwarding, and Raft gossip"
      + from_port                = 8201
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = true
      + source_security_group_id = (known after apply)
      + to_port                  = 8201
      + type                     = "ingress"
    }

  # module.vault.aws_security_group_rule.vault_lb_inbound will be created
  + resource "aws_security_group_rule" "vault_lb_inbound" {
      + cidr_blocks              = [
          + "10.1.0.0/16",
        ]
      + description              = "Allow specified CIDRs access to load balancer on port 8200"
      + from_port                = 8200
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8200
      + type                     = "ingress"
    }

  # module.vault.aws_security_group_rule.vault_lb_outbound will be created
  + resource "aws_security_group_rule" "vault_lb_outbound" {
      + description              = "Allow outbound traffic from load balancer to Vault nodes on port 8200"
      + from_port                = 8200
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8200
      + type                     = "egress"
    }

  # module.vault.aws_security_group_rule.vault_outbound will be created
  + resource "aws_security_group_rule" "vault_outbound" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + description              = "Allow Vault nodes to send outbound traffic"
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # module.vault.aws_security_group_rule.vault_ssh_inbound will be created
  + resource "aws_security_group_rule" "vault_ssh_inbound" {
      + cidr_blocks              = [
          + "10.1.0.0/16",
        ]
      + description              = "Allow specified CIDRs SSH access to Vault nodes"
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

  # module.vault.tls_cert_request.server will be created
  + resource "tls_cert_request" "server" {
      + cert_request_pem = (known after apply)
      + dns_names        = [
          + "vault.witteman-test.com",
          + "localhost",
        ]
      + id               = (known after apply)
      + ip_addresses     = [
          + "127.0.0.1",
        ]
      + key_algorithm    = (known after apply)
      + private_key_pem  = (sensitive value)

      + subject {
          + common_name = "vault.server.com"
        }
    }

  # module.vault.tls_locally_signed_cert.server will be created
  + resource "tls_locally_signed_cert" "server" {
      + allowed_uses          = [
          + "client_auth",
          + "digital_signature",
          + "key_agreement",
          + "key_encipherment",
          + "server_auth",
        ]
      + ca_cert_pem           = (known after apply)
      + ca_key_algorithm      = (known after apply)
      + ca_private_key_pem    = (sensitive value)
      + cert_pem              = (known after apply)
      + cert_request_pem      = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = false
      + ready_for_renewal     = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 720
      + validity_start_time   = (known after apply)
    }

  # module.vault.tls_private_key.ca will be created
  + resource "tls_private_key" "ca" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.vault.tls_private_key.server will be created
  + resource "tls_private_key" "server" {
      + algorithm                     = "RSA"
      + ecdsa_curve                   = "P224"
      + id                            = (known after apply)
      + private_key_openssh           = (sensitive value)
      + private_key_pem               = (sensitive value)
      + private_key_pem_pkcs8         = (sensitive value)
      + public_key_fingerprint_md5    = (known after apply)
      + public_key_fingerprint_sha256 = (known after apply)
      + public_key_openssh            = (known after apply)
      + public_key_pem                = (known after apply)
      + rsa_bits                      = 2048
    }

  # module.vault.tls_self_signed_cert.ca will be created
  + resource "tls_self_signed_cert" "ca" {
      + allowed_uses          = [
          + "cert_signing",
          + "crl_signing",
        ]
      + cert_pem              = (known after apply)
      + early_renewal_hours   = 0
      + id                    = (known after apply)
      + is_ca_certificate     = true
      + key_algorithm         = (known after apply)
      + private_key_pem       = (sensitive value)
      + ready_for_renewal     = false
      + set_authority_key_id  = false
      + set_subject_key_id    = false
      + validity_end_time     = (known after apply)
      + validity_period_hours = 720
      + validity_start_time   = (known after apply)

      + subject {
          + common_name = "ca.vault.server.com"
        }
    }

Plan: 27 to add, 0 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @georgewitteman, Action: `pull_request`*